{
  "seafood": [
    {
      "Name": "Mussels in Spicy Tomato Sauce with Bacon",
      "Thumb": "https://adihadean.ro/wp-content/uploads/2022/06/1.-Coperta-1-1536x1027.jpg",
      "Ingredients": [
        {
          "Name": "Mussels",
          "Quantity": "1000",
          "Unit": "g"
        },
        {
          "Name": "Bacon",
          "Quantity": "100",
          "Unit": "g"
        },
        {
          "Name": "Red onion",
          "Quantity": "1",
          "Unit": "pc"
        },
        {
          "Name": "Garlic",
          "Quantity": "4",
          "Unit": "cloves"
        },
        {
          "Name": "Tomato paste",
          "Quantity": "400",
          "Unit": "ml"
        },
        {
          "Name": "Oregano",
          "Quantity": "1",
          "Unit": "bunch"
        },
        {
          "Name": "Parsley",
          "Quantity": "1",
          "Unit": "bunch"
        },
        {
          "Name": "Chili peppers",
          "Quantity": "2",
          "Unit": "pcs"
        },
        {
          "Name": "Salt",
          "Quantity": "5",
          "Unit": "g"
        },
        {
          "Name": "Pepper",
          "Quantity": "5",
          "Unit": "g"
        }
      ],
      "Instructions": "I adapted this mussel recipe to my taste, with a special sauce featuring bacon, tomatoes, and ingredients that most people probably already have at home. The bacon cubes were browned together with finely chopped red onion and thin slices of chili pepper. No need for oil or other fat, as the bacon has enough, which melts beautifully, giving a delicious caramelized note. I sautéed everything over high heat for about five minutes until the bacon became slightly crispy and the onion softened.\n\nI added the tomato passata, mixed well, and seasoned with salt, pepper, and a teaspoon of sugar to balance the acidity of the tomatoes. For an even fresher flavor, I also added parsley to the sauce.\n\nI let the sauce simmer on low heat, giving the flavors time to infuse the passata. There’s no fixed time – starting at 5 minutes, the sauce is cooked, but the longer it simmers, the tastier it will be.\n\nHow did I finish and serve the mussels in spicy tomato sauce?\nSince vacation food always lets us relax, this recipe is very easy and quick. Basically, after finishing the sauce, all that's left is to cook the mussels. I added all of them to a large pot with the sauce, covered it with a lid, and boiled on high heat for a few minutes, just until the mussels opened (no longer, as overcooking would give the seafood a rubbery and unpleasant texture).\n\nI poured everything into a serving dish, and the sauce settled deliciously in the mussel shells, nestling in pieces of crispy bacon. I added fresh coriander and lemon slices for freshness, and for dipping into the sauce, definitely a few slices of focaccia.\n\nVacations make our lives more beautiful and colorful. And vacation food transports us to wonderful places full of summer memories, until we actually get there. I hope you enjoy my favorite taste of the sea when you cook this postcard-like recipe."
    },
    {
      "Name": "Provençal-style Mussels",
      "Thumb": "https://adihadean.ro/wp-content/uploads/2021/05/poza-finala-1536x1024.jpeg",
      "Ingredients": [
        {
          "Name": "Fresh mussels",
          "Quantity": "1000",
          "Unit": "g"
        },
        {
          "Name": "Onion",
          "Quantity": "1",
          "Unit": "pc"
        },
        {
          "Name": "Green garlic",
          "Quantity": "1",
          "Unit": "bunch"
        },
        {
          "Name": "Olive oil",
          "Quantity": "20",
          "Unit": "ml"
        },
        {
          "Name": "Tomato paste",
          "Quantity": "120",
          "Unit": "ml"
        },
        {
          "Name": "Thyme",
          "Quantity": "1",
          "Unit": "bunch"
        },
        {
          "Name": "Rosemary",
          "Quantity": "1",
          "Unit": "bunch"
        },
        {
          "Name": "Basil leaves",
          "Quantity": "6",
          "Unit": "pcs"
        },
        {
          "Name": "Dry white wine",
          "Quantity": "80",
          "Unit": "ml"
        },
        {
          "Name": "Chili pepper",
          "Quantity": "1",
          "Unit": "pc"
        },
        {
          "Name": "Parsley",
          "Quantity": "1",
          "Unit": "bunch"
        },
        {
          "Name": "Pepper",
          "Quantity": "5",
          "Unit": "g"
        },
        {
          "Name": "Salt",
          "Quantity": "5",
          "Unit": "g"
        }
      ],
      "Instructions": "First of all, I made sure to have ice cubes in the freezer. While I prepared all the ingredients and the cast iron pot with a lid, I kept the mussels in a large bowl covered with a damp kitchen towel and ice.\n\nI discarded the damaged and open mussels and started cleaning the good ones. It was a laborious task, as I scraped each mussel shell with a knife.\n\nAfter thoroughly cleaning them under cold running water, I placed them in a bowl with ice water. I heated the oil in the pot and cooked the chopped onion and the white part of the garlic for 3-4 minutes over medium heat. Then I added the tomato pulp, chili pepper, salt, pepper, and chopped herbs, stirring gently. Since the mussels are slightly salty, just a pinch of salt for cooking is enough. I then added the drained mussels (without the ice) and deglazed everything with wine. I stirred well, put the lid on, and gave the mussels about 10 minutes to open. 2-3 minutes before they were ready, I added chopped parsley and part of the green garlic, finely chopped.\n\nI served the Provençal-style mussels warm, with fries, but they also go well with simple cooked rice or toasted fresh bread. And, of course, I paired this flavorful dish with Pinot Gris, a lightly sparkling dry white wine.\n\nThis is the Provençal-style mussels recipe. Enjoy!"
    },
    {
      "Name": "Saint Jacques Scallops with Asparagus and Fried Egg",
      "Thumb": "https://adihadean.ro/wp-content/uploads/2023/02/cover-1024x568.jpg",
      "Ingredients": [
        {
          "Name": "Saint Jacques scallops",
          "Quantity": "600",
          "Unit": "g"
        },
        {
          "Name": "Asparagus",
          "Quantity": "1",
          "Unit": "bunch"
        },
        {
          "Name": "Eggs",
          "Quantity": "4",
          "Unit": "pcs"
        },
        {
          "Name": "Green onions",
          "Quantity": "1",
          "Unit": "bunch"
        },
        {
          "Name": "Butter",
          "Quantity": "10",
          "Unit": "g"
        },
        {
          "Name": "Salt",
          "Quantity": "5",
          "Unit": "g"
        },
        {
          "Name": "Pepper",
          "Quantity": "5",
          "Unit": "g"
        },
        {
          "Name": "Olive oil",
          "Quantity": "30",
          "Unit": "ml"
        }
      ],
      "Instructions": "First, I take the asparagus, trim the woody ends, wash it thoroughly, and then leave it on a towel to dry. I chose young, raw asparagus with a beautiful color.\n\nNext, I take the scallops, score them on both sides with a knife, and fry them in a hot pan with a little oil and butter.\n\nI fry them for one and a half minutes on each side, no more. Then I remove them onto a plate.\n\nIn their place, I toss in the asparagus, along with two cloves of garlic. I cook the asparagus for about one and a half to two minutes, season it, and then remove it from the pan. The asparagus should remain crunchy and keep its vibrant color.\n\nIn the same pan, I crack an egg and fry it over high heat. I leave the garlic in there. Salt and pepper to taste. And that's all!"
    },
    {
      "Name": "Octopus Stew",
      "Thumb": "https://adihadean.ro/wp-content/uploads/2021/02/A1C7417A-F16E-4175-8199-5132E13F385E-1536x1024.jpeg",
      "Ingredients": [
        {
          "Name": "Octopus",
          "Quantity": "1",
          "Unit": "kg"
        },
        {
          "Name": "Olive oil",
          "Quantity": "40",
          "Unit": "ml"
        },
        {
          "Name": "Red onion",
          "Quantity": "2",
          "Unit": "pcs"
        },
        {
          "Name": "Garlic",
          "Quantity": "3",
          "Unit": "cloves"
        },
        {
          "Name": "Olives",
          "Quantity": "120",
          "Unit": "g"
        },
        {
          "Name": "Bay leaves",
          "Quantity": "3",
          "Unit": "pcs"
        },
        {
          "Name": "Balsamic vinegar",
          "Quantity": "30",
          "Unit": "ml"
        },
        {
          "Name": "Pepper",
          "Quantity": "5",
          "Unit": "g"
        },
        {
          "Name": "Chili flakes",
          "Quantity": "5",
          "Unit": "g"
        },
        {
          "Name": "Honey",
          "Quantity": "20",
          "Unit": "g"
        },
        {
          "Name": "Parsley",
          "Quantity": "1",
          "Unit": "bunch"
        }
      ],
      "Instructions": "I started by preparing the octopus, washing it thoroughly to ensure no sand remained, cutting the tentacles, and setting the head aside. I cut each tentacle into small pieces and rinsed them again.\n\nI left them to drain. Separately, I heated the olive oil in a pan over medium heat and let it warm up. I julienned the onions and tossed them into the pan.\n\nWhile the onion cooked, I chopped the olives and added them to the pan along with the garlic. I sautéed everything for 3-4 minutes, then added the octopus pieces, bay leaves, balsamic vinegar, pepper, chili flakes, and honey.\n\nI stirred well to combine the flavors and let it simmer for 60 minutes with the lid on the pan. I didn't add any salt because the liquid released by the octopus is quite salty.\n\nIn the end, the octopus should be tender and melt in your mouth, with the vinegar sauce having a sweet and tangy flavor. We served it with rice, topped with freshly chopped parsley."
    }
  ]
}
