{
  "pasta": [
    {
      "Name": "Fresh Pasta with Beef, Mushrooms, and Truffle Pesto",
      "Thumb": "https://adihadean.ro/wp-content/uploads/2021/02/Poza-6-bis-1536x1395.jpg",
      "Ingredients": [
        {
          "Name": "Flour",
          "Quantity": "400",
          "Unit": "g"
        },
        {
          "Name": "Egg",
          "Quantity": "4",
          "Unit": "pcs"
        },
        {
          "Name": "Salt",
          "Quantity": "5",
          "Unit": "g"
        },
        {
          "Name": "Pepper",
          "Quantity": "5",
          "Unit": "g"
        },
        {
          "Name": "Olive oil",
          "Quantity": "10",
          "Unit": "ml"
        },
        {
          "Name": "Aged beef sirloin",
          "Quantity": "1000",
          "Unit": "g"
        },
        {
          "Name": "Butter",
          "Quantity": "10",
          "Unit": "g"
        },
        {
          "Name": "Mushrooms",
          "Quantity": "15",
          "Unit": "pcs"
        },
        {
          "Name": "Truffle pesto",
          "Quantity": "1",
          "Unit": "jar"
        }
      ],
      "Instructions": "I placed the flour, eggs, a pinch of salt, and a little olive oil in a bowl. I mixed and kneaded well. I let the dough rest for about 30 minutes. Fresh pasta dough: I divided the dough into 6 equal parts, sprinkled some flour over them, and rolled them out... and done! Now, it's time to cut them! While cutting the pasta by hand works, the pasta machine needs to justify its presence in my kitchen. \n\nWith the pasta drying and waiting to be boiled, I prepared a few pieces of aged beef sirloin (I calculate about 200 g per person). Season the beef with salt and pepper, and into the pan it goes. After 2.5 minutes on each side, I took them out to rest. \n\nIn the same pan, I added a good chunk of butter and sautéed fresh mushrooms of all kinds: champignons, porcini, and honey mushrooms, with a generous pinch of salt. At the end, I enriched them with a healthy spoonful of truffle pesto.\n\nWhile slicing the beef, I boiled the pasta for 2 to 4 minutes, depending on how well they had dried. In the final glorious step, I topped the pasta with the beef, mushrooms, and truffle pesto. Done! Time to take off the apron!"
    },
    {
      "Name": "Spaghetti with Avocado Pesto",
      "Thumb": "https://adihadean.ro/wp-content/uploads/2019/07/Poza6-1024x709.jpg",
      "Ingredients": [
        {
          "Name": "Cherry tomatoes",
          "Quantity": "20",
          "Unit": "pcs"
        },
        {
          "Name": "Spaghetti",
          "Quantity": "250",
          "Unit": "g"
        },
        {
          "Name": "Avocado",
          "Quantity": "2",
          "Unit": "pcs"
        },
        {
          "Name": "Parmesan",
          "Quantity": "100",
          "Unit": "g"
        },
        {
          "Name": "Garlic",
          "Quantity": "1",
          "Unit": "clove"
        },
        {
          "Name": "Lemon",
          "Quantity": "1",
          "Unit": "pc"
        },
        {
          "Name": "Basil leaves",
          "Quantity": "20",
          "Unit": "leaves"
        },
        {
          "Name": "Olive oil",
          "Quantity": "10",
          "Unit": "ml"
        },
        {
          "Name": "Salt",
          "Quantity": "5",
          "Unit": "g"
        },
        {
          "Name": "Pepper",
          "Quantity": "5",
          "Unit": "g"
        }
      ],
      "Instructions": "Step 1: I placed the peeled avocados in a blender, along with the basil leaves, freshly squeezed lemon juice, olive oil, and 2 cloves of garlic. I blended everything into a coarse paste, leaving some texture. I added salt and pepper to taste.\n\nStep 2: In a large pot, I boiled salted water. Once it boiled, I added the spaghetti without breaking them, cooking them until al dente. \n\nMeanwhile, in a pan, I sautéed 2 cloves of garlic in a little olive oil, followed by halved cherry tomatoes. I stirred them just enough to get a slight sear, then added the spaghetti with a few spoonfuls of pasta water.\n\nStep 3: After stirring the pasta for a minute, I added the avocado pesto and plenty of Parmesan.\n\nStep 5: I plated the dish, took a picture, and wished you a good meal! As I said, it's easy to make!"
    },
    {
      "Name": "Pasta with Butter and Cherry Tomatoes",
      "Thumb": "https://adihadean.ro/wp-content/uploads/2023/01/Poza-finala_paste-cu-unt-1536x1152.jpeg",
      "Ingredients": [
        {
          "Name": "Butter",
          "Quantity": "60",
          "Unit": "g"
        },
        {
          "Name": "Pasta (rigatoni)",
          "Quantity": "200",
          "Unit": "g"
        },
        {
          "Name": "Basil leaves",
          "Quantity": "5",
          "Unit": "pcs"
        },
        {
          "Name": "Cherry tomatoes",
          "Quantity": "15",
          "Unit": "pcs"
        },
        {
          "Name": "Water",
          "Quantity": "2",
          "Unit": "liters"
        },
        {
          "Name": "Salt",
          "Quantity": "5",
          "Unit": "g"
        },
        {
          "Name": "Pepper",
          "Quantity": "5",
          "Unit": "g"
        }
      ],
      "Instructions": "I started by boiling water for the pasta, adding a tablespoon of salt before it boiled. I cooked the pasta for a minute less than indicated on the package (11 minutes) because I wanted to finish them in the butter and tomato sauce for the last minute.\n\nIn a pan, I added the butter and tomatoes, letting them fry in the butter for about 3-4 minutes, during which time they released their juices into the pan. I then added a bit more salt and a pinch of pepper.\n\nI finely chopped the basil and added it at the end.\n\nAfter 11 minutes, I transferred the pasta from the pot directly into the butter and tomato pan. I let them cook for another minute over medium heat, stirring gently, and added 2-3 tablespoons of pasta water. This created a beautiful, flavorful emulsion. After a minute of cooking in the butter and tomato juice, I added the final 10 g of butter.\n\nAt the very end, I added the basil and served the pasta warm. They are very tasty, quick to make, and sure to be enjoyed by everyone."
    },
    {
      "Name": "Pasta with Wild Garlic Pesto and Burrata",
      "Thumb": "https://adihadean.ro/wp-content/uploads/2022/03/Poza5_paste-cu-pesto-de-leurda-1536x1152.jpeg",
      "Ingredients": [
        {
          "Name": "Spaghetti",
          "Quantity": "250",
          "Unit": "g"
        },
        {
          "Name": "Walnuts",
          "Quantity": "50",
          "Unit": "g"
        },
        {
          "Name": "Parmesan",
          "Quantity": "50",
          "Unit": "g"
        },
        {
          "Name": "Wild garlic leaves",
          "Quantity": "23",
          "Unit": "g"
        },
        {
          "Name": "Olive oil",
          "Quantity": "40",
          "Unit": "ml"
        },
        {
          "Name": "Salt",
          "Quantity": "5",
          "Unit": "g"
        },
        {
          "Name": "Pepper",
          "Quantity": "5",
          "Unit": "g"
        }
      ],
      "Instructions": "I started by boiling water for the pasta.\n\nNext, I made the wild garlic pesto. I used only wild garlic leaves, grated Parmesan, and pre-toasted walnuts. Toasting the walnuts adds more aroma and flavor. If you don’t have walnuts, you can use almonds or pine nuts. Be careful with wild garlic; I’ve tested other recipes and found that 23 g of leaves are enough because they are quite strong and garlic-flavored. Any more would be too much.\n\nHow did I make the wild garlic pesto?\nI added everything to a container, along with olive oil, pepper, and salt, and blended it with an immersion blender. If you don’t have an immersion blender, a mortar would be perfect.\n\nAfter blending the ingredients, the pesto was ready. Now, it was time to cook the spaghetti. Just before adding the spaghetti to the boiling water, I salted the water. They cooked for 10 minutes. Since they were made from durum wheat, the package listed cooking times, depending on the type of pasta. We prefer them slightly al dente. After cooking the pasta for 5 minutes, I set aside half a cup of pasta water to use later.\n\nOnce the pasta was cooked, I transferred them directly from the pot into a large pan, added the pesto, and mixed well with the reserved pasta water. I tasted to make sure the seasoning was right.\n\nFor serving, I placed the pasta on a plate and topped it with burrata. What can I say? They were devoured instantly. Super tasty, and the burrata added freshness and creaminess to the dish. I hope I’ve convinced you, and I’m curious to see if you’ll try this recipe!"
    }
  ]
}
